dpws/src/test/resources/org/ieee11073/sdc/dpws/soap/wsdiscovery/hello-message.xml

<s:Envelope
        xmlns:a="http://www.w3.org/2005/08/addressing"
        xmlns:d="http://docs.oasis-open.org/ws-dd/ns/discovery/2009/01"
        xmlns:s="http://www.w3.org/2003/05/soap-envelope">
    <s:Header>
        <a:Action>http://docs.oasis-open.org/ws-dd/ns/discovery/2009/01/Hello</a:Action>
        <a:MessageID>http://msg-id/Hello</a:MessageID>
        <a:To>urn:docs-oasis-open-org:ws-dd:ns:discovery:2009:01</a:To>
        <d:AppSequence InstanceId="1077004800" MessageNumber="1"/>
    </s:Header>
    <s:Body>
        <d:Hello>
            <a:EndpointReference>
                <a:Address>http://sample-address</a:Address>
            </a:EndpointReference>
            <d:MetadataVersion>75965</d:MetadataVersion>
        </d:Hello>
    </s:Body>
</s:Envelope>